students/app/controllers/main_controller.rb

SELECT * FROM `contests` WHERE (UNIX_TIMESTAMP(start_time) < UNIX_TIMESTAMP('2009-09-10 15:05:42') AND (UNIX_TIMESTAMP(start_time) + 60 * duration) > UNIX_TIMESTAMP('2009-09-10 15:05:42'))
SELECT * FROM `contests` WHERE (`contests`.`practicable` = 1)
---
  def index
    @contests = Contest.current.select {|contest| contest.visible or current_user.andand.admin?}
    @practice_contests = Contest.practicable.select {|contest| contest.visible or current_user.andand.admin?}

SELECT * FROM `contests` WHERE (`contests`.`id` = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT `runs`.* FROM `runs` INNER JOIN `problems` ON `runs`.problem_id = `problems`.id WHERE ((`problems`.contest_id = 1)) ORDER BY created_at
SELECT * FROM `problems` WHERE (`problems`.contest_id = 1)
---
  def results
    @contest = Contest.find(params[:contest_id])
    if !(@contest.results_visible? or current_user.andand.admin?)
      redirect_to root_path
      return
    end

    students = @contest.runs.during_contest.map(&:user).uniq
    # Results are in the form:
    # [
    #   [student_name, [task1_test1_pts, task1_test2_pts], [task2_test1_pts, ...]]
    # ]
    @results = students.reject(&:admin?).map do |student|
      total = 0
      [student.name] + @contest.problems.map do |problem|