students/app/controllers/admin/contests_controller.rb

SELECT * FROM `contests`
---
  def index
    @contests = Contest.all

INSERT INTO `contests` (`name`, `duration`, `end_time`, `created_at`, `updated_at`, `show_sources`, `about`, `set_code`, `start_time`) VALUES('First contest', 300, '2009-09-14 20:20:00', '2009-09-11 20:21:22', '2009-09-11 20:21:22', 0, 'About to begin!', 'first contest', '2009-09-11 20:20:00')
---
  def create
    @contest = Contest.new params[:contest]

    if @contest.save

SELECT * FROM `contests` WHERE (`contests`.`id` = 3)
---
  def edit
    @contest = Contest.find(params[:id])

SELECT * FROM `contests` WHERE (`contests`.`id` = 1)
UPDATE `contests` SET `updated_at` = '2009-09-12 20:43:51', `end_time` = '2009-09-12 19:56:00' WHERE `id` = 1
---
  def update
    @contest = Contest.find(params[:id])
    @contest.attributes = params[:contest]

    if @contest.save