students/app/controllers/admin/problems_controller.rb

  def new
    @contest = Contest.find params[:contest_id]
---
SELECT * FROM `contests` WHERE (`contests`.`id` = 3)

  def index
    @contest = Contest.find params[:contest_id]
---
SELECT * FROM `contests` WHERE (`contests`.`id` = 1)

  def create
    @contest = Contest.find params[:contest_id]
    @problem = @contest.problems.build params[:problem]

    if @problem.save
---
SELECT * FROM `contests` WHERE (`contests`.`id` = 3)
INSERT INTO `problems` (`name`, `created_at`, `updated_at`, `about`, `contest_id`, `letter`, `time_limit`) VALUES('AB test', '2009-09-10 12:04:11', '2009-09-10 12:04:11', 'desc', 3, NULL, 1)

  def show
    @problem = Problem.find params[:id]
---
SELECT * FROM `problems` WHERE (`problems`.`id` = 1)

  def purge_files
    @problem = Problem.find(params[:id])
---
SELECT * FROM `problems` WHERE (`problems`.`id` = 1)

  def upload_file
    @problem = Problem.find(params[:id])
---
SELECT * FROM `problems` WHERE (`problems`.`id` = 1)

  def do_upload_file
    @problem = Problem.find(params[:id])
---
SELECT * FROM `problems` WHERE (`problems`.`id` = 1)

  def download_file
    @problem = Problem.find(params[:id])
---
SELECT * FROM `problems` WHERE (`problems`.`id` = 2)