students/app/controllers/admin/runs_controller.rb

SELECT * FROM `runs`
SELECT * FROM `contests` WHERE (`contests`.`id` = 1)
SELECT * FROM `problems` WHERE (`problems`.`id` = 1)
---
  def index
    @runs = Run.scoped(:include => :problem)
    @runs = @runs.scoped(:conditions => { :problem_id => params[:problem_id] }) unless params[:problem_id].blank?
    @runs = @runs.scoped(:conditions => ['problems.contest_id = ?', params[:contest_id]]) unless params[:contest_id].blank?

    @contest = Contest.find(params[:contest_id]) unless params[:contest_id].blank?
    @problem = Problem.find(params[:problem_id]) unless params[:problem_id].blank?

UPDATE `runs` SET `updated_at` = '2009-09-12 20:28:21', `status` = 'waiting' WHERE `id` = 1
---
  def queue
    @runs = Run.scoped(:include => :problem)
    @runs = @runs.scoped(:conditions => { :problem_id => params[:problem_id] }) unless params[:problem_id].blank?
    @runs = @runs.scoped(:conditions => { :id => params[:id] }) unless params[:id].blank?
    @runs = @runs.scoped(:conditions => ["problems.contest_id = ?", params[:contest_id]]) unless params[:contest_id].blank?
    @runs.each { |run| run.update_attributes(:status => Run::WAITING) }